templates/openfoam/simpleFoamSpalartAllmaras_initializedField_Re15k/Case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                                                                   |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
         version 	 2.0;
          format 	 ascii;
           class 	 dictionary;
          object 	 blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// https://skill-lync.com/student-projects/Simulation-of-Flow-through-a-pipe-in-OpenFoam-Part-1-26392

convertToMeters 1;

angle 5; 
lduct -0.12 ;
hduct 0.018 ;
cos5deg 0.9961946980917455322950104024738880461835626726458509745254422773;
sin5deg 0.0871557427476581735580642708374735513777011561497026726137433675;
lplenum 2.8 ;
hplenum 1.4 ;  // from the centerline the height is 1.4m
// fuel injector centerline heigths
fuel_injector_bottom_centerline_height 0.0205 ;
fuel_injector_top_centerline_height 0.0235 ;
secondary_inlet_bottom_centerline_height 0.03;

// zdepth 0.01 ;
// hducty #calc "$hduct*$cos5deg";
// hplenumy #calc "$hplenum*$cos5deg";
// zdepth_front #calc "0.5*$hduct*$sin5deg";
// zdepth_back #calc "-0.5*$hduct*$sin5deg";
// zdepth2 #calc "($hplenum)*$sin5deg";
// zdepth2_front #calc "($hplenum)*$sin5deg*0.5";
// zdepth2_back #calc "($hplenum)*$sin5deg*(-0.5)";
// $fuel_injector_top_y $fuel_injector_top*$cos5deg";

hducty 0.017433407216605547 ;
hplenumy 1.3946725773284436 ;
zdepth_front 0.000762612749042009 ;
zdepth_back -0.000762612749042009 ;
zdepth2 0.12201803984672142 ;
zdepth2_front 0.06100901992336071 ;
zdepth2_back -0.06100901992336071 ;
// fuel enjector y coordinates
fuel_injector_top 0.02341057540515602;
fuel_injector_bottom 0.020421991310880783;
secondary_inlet_bottom 0.029885840942752366;
// fuel injector z coordinates
fuel_injector_top_z_front 0.0010240799772849834;
fuel_injector_top_z_back -0.0010240799772849834;
fuel_injector_bottom_z_front 0.0008933463631634963;
fuel_injector_bottom_z_back -0.0008933463631634963;
secondary_inlet_bottom_z_front 0.0013073361412148723;
secondary_inlet_bottom_z_back -0.0013073361412148723;


vertices
(
    ($lduct  0.0 0)   //0
    ($lduct $hducty $zdepth_front) // 1
    ($lduct $hducty $zdepth_back) // 2
    (0 0.0 0)  // 3
    (0 $hducty $zdepth_front)   //4
    (0 $hducty $zdepth_back)   // 5
    ($lplenum 0.0 0) // 6
    ($lplenum $hducty $zdepth_front)  // 7
    ($lplenum $hducty $zdepth_back)  // 8
		
    (0.0 $hplenumy $zdepth2_front)  // 9
    ($lplenum $hplenumy $zdepth2_front)  // 10
    ($lplenum $hplenumy $zdepth2_back)  // 11
    (0.0 $hplenumy $zdepth2_back)  // 12

    // fuel injector points (at x=0)
    (0 $fuel_injector_bottom $fuel_injector_bottom_z_front) // 13
    (0 $fuel_injector_bottom $fuel_injector_bottom_z_back) // 14
    (0 $fuel_injector_top $fuel_injector_top_z_front) // 15
    (0 $fuel_injector_top $fuel_injector_top_z_back) // 16
    (0 $secondary_inlet_bottom $secondary_inlet_bottom_z_front) // 17
    (0 $secondary_inlet_bottom $secondary_inlet_bottom_z_back) // 18

    // fuel injector points (at x=lplenum)
    ($lplenum $fuel_injector_bottom $fuel_injector_bottom_z_front) // 19
    ($lplenum $fuel_injector_bottom $fuel_injector_bottom_z_back) // 20
    ($lplenum $fuel_injector_top $fuel_injector_top_z_front) // 21
    ($lplenum $fuel_injector_top $fuel_injector_top_z_back) // 22
    ($lplenum $secondary_inlet_bottom $secondary_inlet_bottom_z_front) // 23
    ($lplenum $secondary_inlet_bottom $secondary_inlet_bottom_z_back) // 24
	

);

blocks
(
	// front duct	 
	hex (0 3 5 2 0 3 4 1) (30 17 1) simplegrading (0.9 0.2 1) 
	// bottom part of plenum
	 hex (3 6 8 5 3 6 7 4) (140 17 1) simplegrading (35 0.2 1)
	 // plenum below fuel injector
	hex (5 8 20 14 4 7 19 13) (140 5 1) simplegrading (35 1 1)
 	// plenum at fuel injector
	hex (14 20 22 16 13 19 21 15) (140 5 1) simplegrading (35 1 1)
	// plenum above fuel injector
	hex (16 22 24 18 15 21 23 17) (140 5 1) simplegrading (35 1 1)
	// upper part of plenum 
	hex (18 24 11 12 17 23 10 9) (140 50 1) simplegrading (35 80 1)


);
edges
(
	 //arc 1 2 (0 1.250000e-02 0)
	 //arc 4 5 (3.150000e+00 1.250000e-02 0)
);
boundary
(
	 inlet
	 {
		 type patch;
		 faces
		 (
			 (0 1 2 0)
		 );
	 }

	 outlet
		 {
		 type patch;
		 faces
		 (
			 //(3 4 5 3)
			 (6 7 8 6)
			 (7 19 20 8)
			 (19 21 22 20)
			 (21 23 24 22)
			 (23 10 11 24)
		 );
	 }
	 top
	 	{
	 	type wall;
	 	faces
	 	(
		 	(1 2 5 4)
			(9 12 11 10)
	 	);
	 }
	 secondaryInlet
	 	{
	 	type patch;
	 	faces
	 	(
			(17 18 12 9)
	 	);
	 }
	 frontWall
	 	{
	 	type wall;
	 	faces
	 	(
			(15 16 18 17)
			(4 5 14 13)
	 	);
	 }
	 fuelInjector
	 	{
	 	type patch;
	 	faces
	 	(
			(13 14 16 15)

	 	);
	 }


	 back
	 {
	 type wedge;
	 faces
	 (
		 (0 1 4 3)
		(3 4 7 6)
		(4 13 19 7)
		(13 15 21 19)
		(15 17 23 21)
		(17 9 10 23)
	 );
	 }
	 front
	 {
	 type wedge;
	 faces
	 (
		 (0 2 5 3)
		(3 5 8 6)
		(5 14 20 8)
		(14 16 22 20)
		(16 18 24 22)
		(18 12 11 24)
	 );
	 }
	 axis
	 {
	 type empty;
	 faces
	 (
		 (0 3 3 0)
		(3 6 6 3)
	 );
	 }
);
mergePatchPairs
(
);
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
