templates/openfoam/simpleFoamSpalartAllmaras_initializedField_Re15k/Case/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
11990
(
7.64687e-10
7.61914e-10
7.59151e-10
7.56398e-10
7.53655e-10
7.50922e-10
7.48199e-10
7.45485e-10
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
17
(
1.81451e-07
4.76559e-07
6.86482e-07
8.29751e-07
9.21229e-07
9.72813e-07
9.93994e-07
9.92323e-07
9.73783e-07
9.4309e-07
9.03945e-07
8.59234e-07
8.11185e-07
7.61506e-07
7.11488e-07
6.62091e-07
6.14016e-07
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
82
(
1.81451e-07
4.76559e-07
6.86482e-07
8.29751e-07
9.21229e-07
9.72813e-07
9.93994e-07
9.92323e-07
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
170
(
6.42774e-06
6.40443e-06
6.3812e-06
6.35806e-06
6.335e-06
6.31203e-06
6.28914e-06
6.26633e-06
...
)
;
    }
    secondaryInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
3.95536e-06
4.54365e-06
5.22972e-06
6.03109e-06
6.96856e-06
8.06684e-06
9.35529e-06
1.08688e-05
...
)
;
    }
    frontWall
    {
        type            calculated;
        value           nonuniform List<scalar> 10(2.72584e-06 2.87257e-06 3.01931e-06 3.16604e-06 3.31277e-06 9.27281e-07 9.58538e-07 9.89795e-07 1.02105e-06 1.05231e-06);
    }
    fuelInjector
    {
        type            calculated;
        value           nonuniform List<scalar> 5(1.08356e-06 1.11482e-06 1.14608e-06 1.17733e-06 1.20859e-06);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
