templates/openfoam/simpleFoamSpalartAllmaras_initializedField_Re15k/Case/0/nutSource
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nutSource;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
11990
(
0.000000
0.000000
0.000000
0.000000
0.000000
0.000000
0.000000
0.000000
...
0.000000

)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    secondaryInlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    fuelInjector
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    frontWall
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    top
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
